#### 📖 Terraform Plan ('infra/resources/dev') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.apim.azurerm_api_management_diagnostic.applicationinsights[0] will be updated in-place
  ~ resource "azurerm_api_management_diagnostic" "applicationinsights" {
      ~ api_management_logger_id  = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.ApiManagement/service/dx-d-itn-playground-pg-apim-01/loggers/dx-d-itn-playground-pg-apim-01-logger" -> (known after apply)
        id                        = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.ApiManagement/service/dx-d-itn-playground-pg-apim-01/diagnostics/applicationinsights"
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.apim.azurerm_api_management_logger.this[0] must be replaced
-/+ resource "azurerm_api_management_logger" "this" {
      ~ id                  = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.ApiManagement/service/dx-d-itn-playground-pg-apim-01/loggers/dx-d-itn-playground-pg-apim-01-logger" -> (known after apply)
        name                = "dx-d-itn-playground-pg-apim-01-logger"
      ~ resource_id         = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Insights/components/dx-d-playground-appi-01" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)

      ~ application_insights {
          ~ connection_string   = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.apim.azurerm_monitor_diagnostic_setting.apim[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "apim" {
        id                             = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.ApiManagement/service/dx-d-itn-playground-pg-apim-01|dx-d-itn-playground-pg-apim-01-diagnostic"
      ~ log_analytics_workspace_id     = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.OperationalInsights/workspaces/dx-d-playground-log-01" -> (known after apply)
        name                           = "dx-d-itn-playground-pg-apim-01-diagnostic"
        # (4 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.app_service.azurerm_linux_web_app.this will be updated in-place
  ~ resource "azurerm_linux_web_app" "this" {
      ~ app_settings                                   = {
          - "API_BASE_PATH"                                   = "todo"
          - "API_BASE_URL"                                    = "https://dx-d-itn-playground-pg-apim-01.azure-api.net"
          - "API_KEY"                                         = "@Microsoft.KeyVault(SecretUri=https://dx-d-itn-common-kv-01.vault.azure.net/secrets/playground-apim-test-key)"
          - "APPINSIGHTS_SAMPLING_PERCENTAGE"                 = "100"
          - "APPLICATIONINSIGHTS_CONNECTION_STRING"           = (sensitive value)
          - "OTEL_SERVICE_NAME"                               = "To Do WebApp"
          - "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          - "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          - "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
          - "WEBSITE_SWAP_WARMUP_PING_PATH"                   = "/"
          - "WEBSITE_SWAP_WARMUP_PING_STATUSES"               = "200,204"
          - "WEBSITE_WARMUP_PATH"                             = "/"
        } -> (known after apply)
        id                                             = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Web/sites/dx-d-itn-playground-fe-app-01"
        name                                           = "dx-d-itn-playground-fe-app-01"
      ~ tags                                           = {
            "BusinessUnit"                                   = "DevEx"
            "CostCenter"                                     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Dev"
            "ManagementTeam"                                 = "Developer Experience"
            "ModuleName"                                     = "azure_app_service"
            "ModuleSource"                                   = "DX"
          ~ "ModuleVersion"                                  = "0.2.0" -> "0.2.1"
            "Scope"                                          = "Dynatrace PoC"
            "Source"                                         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
        # (25 unchanged attributes hidden)

      ~ site_config {
          ~ minimum_tls_version                           = "1.3" -> "1.2"
            # (27 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.app_service.azurerm_private_endpoint.app_service_sites will be updated in-place
  ~ resource "azurerm_private_endpoint" "app_service_sites" {
        id                            = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Network/privateEndpoints/dx-d-itn-playground-fe-app-pep-01"
        name                          = "dx-d-itn-playground-fe-app-pep-01"
      ~ tags                          = {
            "BusinessUnit"   = "DevEx"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Dev"
            "ManagementTeam" = "Developer Experience"
            "ModuleName"     = "azure_app_service"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.2.0" -> "0.2.1"
            "Scope"          = "Dynatrace PoC"
            "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.app_service.azurerm_service_plan.this[0] will be updated in-place
  ~ resource "azurerm_service_plan" "this" {
        id                              = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Web/serverFarms/dx-d-itn-playground-fe-asp-01"
        name                            = "dx-d-itn-playground-fe-asp-01"
      ~ tags                            = {
            "BusinessUnit"   = "DevEx"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Dev"
            "ManagementTeam" = "Developer Experience"
            "ModuleName"     = "azure_app_service"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.2.0" -> "0.2.1"
            "Scope"          = "Dynatrace PoC"
            "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
        # (12 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_application_insights.main will be destroyed
  # (because azurerm_application_insights.main is not in configuration)
  - resource "azurerm_application_insights" "main" {
      - app_id                                = "d510e11b-e161-4ba7-a02e-3019b24c00e6" -> null
      - application_type                      = "other" -> null
      - connection_string                     = (sensitive value) -> null
      - daily_data_cap_in_gb                  = 100 -> null
      - daily_data_cap_notifications_disabled = false -> null
      - disable_ip_masking                    = false -> null
      - force_customer_storage_for_profiler   = false -> null
      - id                                    = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Insights/components/dx-d-playground-appi-01" -> null
      - instrumentation_key                   = (sensitive value) -> null
      - internet_ingestion_enabled            = true -> null
      - internet_query_enabled                = true -> null
      - local_authentication_disabled         = false -> null
      - location                              = "italynorth" -> null
      - name                                  = "dx-d-playground-appi-01" -> null
      - resource_group_name                   = "dx-d-itn-test-rg-01" -> null
      - retention_in_days                     = 90 -> null
      - sampling_percentage                   = 100 -> null
      - tags                                  = {
          - "BusinessUnit"   = "DevEx"
          - "CostCenter"     = "TS000 - Tecnologia e Servizi"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Dev"
          - "ManagementTeam" = "Developer Experience"
          - "Scope"          = "Dynatrace PoC"
          - "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        } -> null
      - workspace_id                          = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.OperationalInsights/workspaces/dx-d-playground-log-01" -> null
    }

  # module.application_insights.azurerm_key_vault_secret.ai_connection_string will be destroyed
  # (because azurerm_key_vault_secret.ai_connection_string is not in configuration)
  - resource "azurerm_key_vault_secret" "ai_connection_string" {
      - id                      = "https://dx-d-itn-common-kv-01.vault.azure.net/secrets/playground-ai-connection-string/204461018964493d887a88ffcd913f11" -> null
      - key_vault_id            = (sensitive value) -> null
      - name                    = "playground-ai-connection-string" -> null
      - resource_id             = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-common-rg-01/providers/Microsoft.KeyVault/vaults/dx-d-itn-common-kv-01/secrets/playground-ai-connection-string/versions/204461018964493d887a88ffcd913f11" -> null
      - resource_versionless_id = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-common-rg-01/providers/Microsoft.KeyVault/vaults/dx-d-itn-common-kv-01/secrets/playground-ai-connection-string" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - value_wo_version        = 0 -> null
      - version                 = "204461018964493d887a88ffcd913f11" -> null
      - versionless_id          = "https://dx-d-itn-common-kv-01.vault.azure.net/secrets/playground-ai-connection-string" -> null
        # (1 unchanged attribute hidden)
    }

  # module.application_insights.azurerm_log_analytics_workspace.main will be destroyed
  # (because azurerm_log_analytics_workspace.main is not in configuration)
  - resource "azurerm_log_analytics_workspace" "main" {
      - allow_resource_only_permissions         = true -> null
      - cmk_for_query_forced                    = false -> null
      - daily_quota_gb                          = -1 -> null
      - id                                      = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.OperationalInsights/workspaces/dx-d-playground-log-01" -> null
      - immediate_data_purge_on_30_days_enabled = false -> null
      - internet_ingestion_enabled              = true -> null
      - internet_query_enabled                  = true -> null
      - local_authentication_disabled           = false -> null
      - location                                = "italynorth" -> null
      - name                                    = "dx-d-playground-log-01" -> null
      - primary_shared_key                      = (sensitive value) -> null
      - resource_group_name                     = "dx-d-itn-test-rg-01" -> null
      - retention_in_days                       = 30 -> null
      - secondary_shared_key                    = (sensitive value) -> null
      - sku                                     = "PerGB2018" -> null
      - tags                                    = {
          - "BusinessUnit"   = "DevEx"
          - "CostCenter"     = "TS000 - Tecnologia e Servizi"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Dev"
          - "ManagementTeam" = "Developer Experience"
          - "Scope"          = "Dynatrace PoC"
          - "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        } -> null
      - workspace_id                            = "1f1204bb-f6e7-406b-8968-2ae1cc18043d" -> null
        # (1 unchanged attribute hidden)
    }

  # module.azure_function_v3_application_insights.azurerm_application_insights.main will be created
  + resource "azurerm_application_insights" "main" {
      + app_id                              = (known after apply)
      + application_type                    = "other"
      + connection_string                   = (sensitive value)
      + daily_data_cap_in_gb                = 100
      + disable_ip_masking                  = false
      + force_customer_storage_for_profiler = false
      + id                                  = (known after apply)
      + instrumentation_key                 = (sensitive value)
      + internet_ingestion_enabled          = true
      + internet_query_enabled              = true
      + local_authentication_disabled       = false
      + location                            = "italynorth"
      + name                                = "dx-d-itn-playground-azure-function-v3-appi-01"
      + resource_group_name                 = "dx-d-itn-test-rg-01"
      + retention_in_days                   = 90
      + sampling_percentage                 = 100
      + tags                                = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "Scope"          = "Dynatrace PoC"
          + "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
      + workspace_id                        = (known after apply)
    }

  # module.azure_function_v3_application_insights.azurerm_key_vault_secret.ai_connection_string will be created
  + resource "azurerm_key_vault_secret" "ai_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = (sensitive value)
      + name                    = "dx-d-itn-playground-azure-function-v3-appi-01-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.azure_function_v3_application_insights.azurerm_log_analytics_workspace.main will be created
  + resource "azurerm_log_analytics_workspace" "main" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "italynorth"
      + name                            = "dx-d-itn-playground-azure-function-v3-log-01"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "dx-d-itn-test-rg-01"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "Scope"          = "Dynatrace PoC"
          + "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
      + workspace_id                    = (known after apply)
    }

  # module.function_app.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Web/sites/dx-d-itn-playground-be-func-01"
        name                                           = "dx-d-itn-playground-be-func-01"
      ~ tags                                           = {
            "BusinessUnit"                                   = "DevEx"
            "CostCenter"                                     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Dev"
            "ManagementTeam"                                 = "Developer Experience"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
          ~ "ModuleVersion"                                  = "0.3.0" -> "0.3.1"
            "Scope"                                          = "Dynatrace PoC"
            "Source"                                         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
        # (34 unchanged attributes hidden)

      ~ site_config {
          ~ application_insights_connection_string        = (sensitive value)
          ~ minimum_tls_version                           = "1.3" -> "1.2"
            # (31 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.function_app.azurerm_private_endpoint.function_sites will be updated in-place
  ~ resource "azurerm_private_endpoint" "function_sites" {
        id                            = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Network/privateEndpoints/dx-d-itn-playground-be-func-pep-01"
        name                          = "dx-d-itn-playground-be-func-pep-01"
      ~ tags                          = {
            "BusinessUnit"   = "DevEx"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Dev"
            "ManagementTeam" = "Developer Experience"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.0" -> "0.3.1"
            "Scope"          = "Dynatrace PoC"
            "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_app.azurerm_private_endpoint.st_blob will be updated in-place
  ~ resource "azurerm_private_endpoint" "st_blob" {
        id                            = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Network/privateEndpoints/dx-d-itn-playground-be-blob-pep-01"
        name                          = "dx-d-itn-playground-be-blob-pep-01"
      ~ tags                          = {
            "BusinessUnit"   = "DevEx"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Dev"
            "ManagementTeam" = "Developer Experience"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.0" -> "0.3.1"
            "Scope"          = "Dynatrace PoC"
            "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_app.azurerm_private_endpoint.st_file will be updated in-place
  ~ resource "azurerm_private_endpoint" "st_file" {
        id                            = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Network/privateEndpoints/dx-d-itn-playground-be-file-pep-01"
        name                          = "dx-d-itn-playground-be-file-pep-01"
      ~ tags                          = {
            "BusinessUnit"   = "DevEx"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Dev"
            "ManagementTeam" = "Developer Experience"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.0" -> "0.3.1"
            "Scope"          = "Dynatrace PoC"
            "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_app.azurerm_private_endpoint.st_queue will be updated in-place
  ~ resource "azurerm_private_endpoint" "st_queue" {
        id                            = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Network/privateEndpoints/dx-d-itn-playground-be-queue-pep-01"
        name                          = "dx-d-itn-playground-be-queue-pep-01"
      ~ tags                          = {
            "BusinessUnit"   = "DevEx"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Dev"
            "ManagementTeam" = "Developer Experience"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.0" -> "0.3.1"
            "Scope"          = "Dynatrace PoC"
            "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_app.azurerm_service_plan.this[0] will be updated in-place
  ~ resource "azurerm_service_plan" "this" {
        id                              = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Web/serverFarms/dx-d-itn-playground-be-asp-01"
        name                            = "dx-d-itn-playground-be-asp-01"
      ~ tags                            = {
            "BusinessUnit"   = "DevEx"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Dev"
            "ManagementTeam" = "Developer Experience"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.0" -> "0.3.1"
            "Scope"          = "Dynatrace PoC"
            "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
        # (12 unchanged attributes hidden)
    }

  # module.function_app.azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
        id                                 = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Storage/storageAccounts/dxditnplaygroundbestfn01"
        name                               = "dxditnplaygroundbestfn01"
      ~ tags                               = {
            "BusinessUnit"   = "DevEx"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Dev"
            "ManagementTeam" = "Developer Experience"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.0" -> "0.3.1"
            "Scope"          = "Dynatrace PoC"
            "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.function_test_durable.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Web/sites/dx-d-itn-playground-df-func-01"
        name                                           = "dx-d-itn-playground-df-func-01"
      ~ tags                                           = {
            "BusinessUnit"                                   = "DevEx"
            "CostCenter"                                     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Dev"
            "ManagementTeam"                                 = "Developer Experience"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
          ~ "ModuleVersion"                                  = "0.3.0" -> "0.3.1"
            "Scope"                                          = "Dynatrace PoC"
            "Source"                                         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
        # (34 unchanged attributes hidden)

      ~ site_config {
          ~ minimum_tls_version                           = "1.3" -> "1.2"
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.function_test_durable.azurerm_private_endpoint.function_sites will be updated in-place
  ~ resource "azurerm_private_endpoint" "function_sites" {
        id                            = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Network/privateEndpoints/dx-d-itn-playground-df-func-pep-01"
        name                          = "dx-d-itn-playground-df-func-pep-01"
      ~ tags                          = {
            "BusinessUnit"   = "DevEx"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Dev"
            "ManagementTeam" = "Developer Experience"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.0" -> "0.3.1"
            "Scope"          = "Dynatrace PoC"
            "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_test_durable.azurerm_private_endpoint.st_blob will be updated in-place
  ~ resource "azurerm_private_endpoint" "st_blob" {
        id                            = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Network/privateEndpoints/dx-d-itn-playground-df-blob-pep-01"
        name                          = "dx-d-itn-playground-df-blob-pep-01"
      ~ tags                          = {
            "BusinessUnit"   = "DevEx"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Dev"
            "ManagementTeam" = "Developer Experience"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.0" -> "0.3.1"
            "Scope"          = "Dynatrace PoC"
            "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_test_durable.azurerm_private_endpoint.st_file will be updated in-place
  ~ resource "azurerm_private_endpoint" "st_file" {
        id                            = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Network/privateEndpoints/dx-d-itn-playground-df-file-pep-01"
        name                          = "dx-d-itn-playground-df-file-pep-01"
      ~ tags                          = {
            "BusinessUnit"   = "DevEx"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Dev"
            "ManagementTeam" = "Developer Experience"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.0" -> "0.3.1"
            "Scope"          = "Dynatrace PoC"
            "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_test_durable.azurerm_private_endpoint.st_queue will be updated in-place
  ~ resource "azurerm_private_endpoint" "st_queue" {
        id                            = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Network/privateEndpoints/dx-d-itn-playground-df-queue-pep-01"
        name                          = "dx-d-itn-playground-df-queue-pep-01"
      ~ tags                          = {
            "BusinessUnit"   = "DevEx"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Dev"
            "ManagementTeam" = "Developer Experience"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.0" -> "0.3.1"
            "Scope"          = "Dynatrace PoC"
            "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_test_durable.azurerm_private_endpoint.std_blob[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "std_blob" {
        id                            = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Network/privateEndpoints/dx-d-itn-playground-df-dblob-pep-01"
        name                          = "dx-d-itn-playground-df-dblob-pep-01"
      ~ tags                          = {
            "BusinessUnit"   = "DevEx"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Dev"
            "ManagementTeam" = "Developer Experience"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.0" -> "0.3.1"
            "Scope"          = "Dynatrace PoC"
            "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_test_durable.azurerm_private_endpoint.std_file[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "std_file" {
        id                            = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Network/privateEndpoints/dx-d-itn-playground-df-dfile-pep-01"
        name                          = "dx-d-itn-playground-df-dfile-pep-01"
      ~ tags                          = {
            "BusinessUnit"   = "DevEx"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Dev"
            "ManagementTeam" = "Developer Experience"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.0" -> "0.3.1"
            "Scope"          = "Dynatrace PoC"
            "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_test_durable.azurerm_private_endpoint.std_queue[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "std_queue" {
        id                            = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Network/privateEndpoints/dx-d-itn-playground-df-dqueue-pep-01"
        name                          = "dx-d-itn-playground-df-dqueue-pep-01"
      ~ tags                          = {
            "BusinessUnit"   = "DevEx"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Dev"
            "ManagementTeam" = "Developer Experience"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.0" -> "0.3.1"
            "Scope"          = "Dynatrace PoC"
            "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_test_durable.azurerm_private_endpoint.std_table[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "std_table" {
        id                            = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Network/privateEndpoints/dx-d-itn-playground-df-dtable-pep-01"
        name                          = "dx-d-itn-playground-df-dtable-pep-01"
      ~ tags                          = {
            "BusinessUnit"   = "DevEx"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Dev"
            "ManagementTeam" = "Developer Experience"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.0" -> "0.3.1"
            "Scope"          = "Dynatrace PoC"
            "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_test_durable.azurerm_service_plan.this[0] will be updated in-place
  ~ resource "azurerm_service_plan" "this" {
        id                              = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Web/serverFarms/dx-d-itn-playground-df-asp-01"
        name                            = "dx-d-itn-playground-df-asp-01"
      ~ tags                            = {
            "BusinessUnit"   = "DevEx"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Dev"
            "ManagementTeam" = "Developer Experience"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.0" -> "0.3.1"
            "Scope"          = "Dynatrace PoC"
            "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
        # (12 unchanged attributes hidden)
    }

  # module.function_test_durable.azurerm_storage_account.durable_function[0] will be updated in-place
  ~ resource "azurerm_storage_account" "durable_function" {
        id                                 = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Storage/storageAccounts/dxditnplaygrounddfstfd01"
        name                               = "dxditnplaygrounddfstfd01"
      ~ tags                               = {
            "BusinessUnit"   = "DevEx"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Dev"
            "ManagementTeam" = "Developer Experience"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.0" -> "0.3.1"
            "Scope"          = "Dynatrace PoC"
            "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.function_test_durable.azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
        id                                 = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Storage/storageAccounts/dxditnplaygrounddfstfn01"
        name                               = "dxditnplaygrounddfstfn01"
      ~ tags                               = {
            "BusinessUnit"   = "DevEx"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Dev"
            "ManagementTeam" = "Developer Experience"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.0" -> "0.3.1"
            "Scope"          = "Dynatrace PoC"
            "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.to_do_api.azurerm_api_management_api_policy.policy will be updated in-place
  ~ resource "azurerm_api_management_api_policy" "policy" {
        id                  = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.ApiManagement/service/dx-d-itn-playground-pg-apim-01/apis/to-do-api"
      ~ xml_content         = <<-EOT
          - <policies>
          - 	<inbound>
          - 		<base />
          - 		<set-backend-service backend-id="to-do-api-azure-function" />
          - 		<!-- Append base-path, if defined, before invoking the backend -->
          - 		<choose>
          - 			<when condition="@(System.String.IsNullOrEmpty("api"))"></when>
          - 			<otherwise>
          - 				<rewrite-uri template="@(System.String.Concat("api/", context.Request.Url.Path))" />
          - 			</otherwise>
          - 		</choose>
          - 		<cors>
          - 			<allowed-origins>
          - 				<origin>*</origin>
          - 			</allowed-origins>
          - 			<allowed-methods>
          - 				<method>*</method>
          - 			</allowed-methods>
          - 			<allowed-headers>
          - 				<header>*</header>
          - 			</allowed-headers>
          - 			<expose-headers>
          - 				<header>*</header>
          - 			</expose-headers>
          - 		</cors>
          - 	</inbound>
          - 	<outbound>
          - 		<base />
          - 	</outbound>
          - 	<backend>
          - 		<base />
          - 	</backend>
          - 	<on-error>
          - 		<base />
          - 	</on-error>
          + <policies>
          +   <inbound>
          +     <base />
          +     <set-backend-service backend-id="to-do-api-azure-function" />
          + 
          +      <!-- Append base-path, if defined, before invoking the backend -->
          +     <choose>
          +       <when condition='@(System.String.IsNullOrEmpty("api"))'>
          +       </when>
          +       <otherwise>
          +         <rewrite-uri template='@(System.String.Concat("api/", context.Request.Url.Path))' />
          +       </otherwise>
          +     </choose>
          + 
          +     <cors>
          +       <allowed-origins>
          +           <origin>*</origin>
          +       </allowed-origins>
          +       <allowed-methods>
          +           <method>*</method>
          +       </allowed-methods>
          +       <allowed-headers>
          +           <header>*</header>
          +       </allowed-headers>
          +       <expose-headers>
          +           <header>*</header>
          +       </expose-headers>
          +     </cors>
          +   </inbound>
          +   <outbound>
          +     <base />
          +   </outbound>
          +   <backend>
          +     <base />
          +   </backend>
          +   <on-error>
          +     <base />
          +   </on-error>
            </policies>
        EOT
        # (4 unchanged attributes hidden)
    }

  # module.to_do_api_application_insights.azurerm_application_insights.main will be created
  + resource "azurerm_application_insights" "main" {
      + app_id                              = (known after apply)
      + application_type                    = "other"
      + connection_string                   = (sensitive value)
      + daily_data_cap_in_gb                = 100
      + disable_ip_masking                  = false
      + force_customer_storage_for_profiler = false
      + id                                  = (known after apply)
      + instrumentation_key                 = (sensitive value)
      + internet_ingestion_enabled          = true
      + internet_query_enabled              = true
      + local_authentication_disabled       = false
      + location                            = "italynorth"
      + name                                = "dx-d-itn-playground-to-do-api-appi-01"
      + resource_group_name                 = "dx-d-itn-test-rg-01"
      + retention_in_days                   = 90
      + sampling_percentage                 = 100
      + tags                                = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "Scope"          = "Dynatrace PoC"
          + "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
      + workspace_id                        = (known after apply)
    }

  # module.to_do_api_application_insights.azurerm_key_vault_secret.ai_connection_string will be created
  + resource "azurerm_key_vault_secret" "ai_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = (sensitive value)
      + name                    = "dx-d-itn-playground-to-do-api-appi-01-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.to_do_api_application_insights.azurerm_log_analytics_workspace.main will be created
  + resource "azurerm_log_analytics_workspace" "main" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "italynorth"
      + name                            = "dx-d-itn-playground-to-do-api-log-01"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "dx-d-itn-test-rg-01"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "Scope"          = "Dynatrace PoC"
          + "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
      + workspace_id                    = (known after apply)
    }

Plan: 7 to add, 25 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
